Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
            esp8266_skip_http_response_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}

        	menuStatusMessage = (c == '0') ? plus_connect_failed : plus_removed;

        	esp8266_PlusStore_API_end_transmission();

        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_OFFLINE_ROM_UPDATE) == mts) {

			if( flash_download("&r=1", d->filesize , 0 , false ) != DOWNLOAD_AREA_START_ADDRESS)
				menuStatusMessage = download_failed;

			else {
				menuStatusMessage = done;
	        	*curPath = 0;
			}
		}

		else if (strstr(mts, MENU_TEXT_DELETE_OFFLINE_ROMS) == mts) {

			flash_erase_storage((uint8_t)FLASH_SECTOR_5);
			user_settings.first_free_flash_sector = (uint8_t) FLASH_SECTOR_5;
		    flash_set_eeprom_user_settings(user_settings);
		    menuStatusMessage = offline_roms_deleted;
        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_DETECT_OFFLINE_ROMS) == mts) {

			uint32_t last_address = flash_check_offline_roms_size();
			if(last_address > DOWNLOAD_AREA_START_ADDRESS + 1024){
			    user_settings.first_free_flash_sector = (uint8_t) (((last_address - ADDR_FLASH_SECTOR_5) / 0x20000 ) + 6);
			    flash_set_eeprom_user_settings(user_settings);
			    menuStatusMessage = offline_roms_detected;
			}

			else
				menuStatusMessage = no_offline_roms_detected;

    		num_menu_entries = 0;
        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_WPS_CONNECT) == mts) {

	    	menuStatusMessage = esp8266_wps_connect() ? wifi_connected : wifi_not_connected;
			*curPath = 0;
			HAL_Delay(2000);
		}

		else if (strstr(mts, MENU_TEXT_WIFI_MANAGER) == mts) {

			menuStatusMessage = done;
			esp8266_AT_WiFiManager();
	    	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_ESP8266_RESTORE) == mts) {

			menuStatusMessage = esp8266_reset(true) ? done : failed;
			*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_PRIVATE_KEY) == mts) {

			if(d->type == Menu_Action) { // if actual Entry is of type Menu_Action -> Save Private key
				menuStatusMessage = private_key_saved;
	        	*curPath = 0;
			}

			else {

				if (!strcmp(mts, MENU_TEXT_PRIVATE_KEY ))
					menuStatusMessage = private_key;		//????  what have i broken that this compare would have worked

				menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, private_key);
			}
		}
	}

	else if (strstr(curPath, MENU_TEXT_OFFLINE_ROMS) == curPath) {
		make_menu_entry(&dst, "..", Leave_Menu);
		flash_file_list(&curPath[sizeof(MENU_TEXT_OFFLINE_ROMS) - 1], &dst, &num_menu_entries);
	}

	else if (strstr(curPath, MENU_TEXT_SEARCH_FOR_ROM) == curPath) {

		if(d->type == Menu_Action){
			// Send search to API
			for (char* p = curPath; (p = strchr(p, ' ')); *p++ = '+');			// ' ' --> '+'
			loadStore = true;
			menuStatusMessage = STATUS_CHOOSE_ROM;
		}
		else
			menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, STATUS_SEARCH_DETAILS);
	}

	else if (d->type == Menu_Action){

		if (strstr(curPath, MENU_TEXT_FIRMWARE_UPDATE) == curPath) {

			strcpy(curPath, "&u=1");

			uint32_t bytes_read = esp8266_PlusStore_API_file_request( buffer, curPath, 0, 0x4000 );
			bytes_read += esp8266_PlusStore_API_file_request( &buffer[0x4000], curPath, 0x8000, (d->filesize - 0x8000) );
			if(bytes_read == d->filesize - 0x4000 ){
				__disable_irq();
				HAL_FLASH_Unlock();
				flash_firmware_update(d->filesize);
			}else{
				menuStatusMessage = download_failed;
			}
		}

		else if (strstr(curPath, MENU_TEXT_WIFI_RECONNECT) == curPath)
			loadStore = true;

		*curPath = 0;

	}

	else {
		set_menu_status_msg(curPath);
		loadStore = true;
	}


	// Test we should load store and if connected to AP
    if(	loadStore || strlen(curPath) == 0 ){
    	if(esp8266_is_connected() == true){
			if( esp8266_PlusStore_API_connect() == false){
				return esp_timeout;
			}
			esp8266_PlusStore_API_prepare_request_header(curPath, false, false);

        	esp8266_print(http_request_header);
            uint16_t bytes_read = 0, content_length = esp8266_skip_http_response_header();
        	count = 0;
        	while(bytes_read < content_length){
        		if(HAL_UART_Receive(&huart1, &c, 1, 15000 ) != HAL_OK){
        			break;
        		}
        		if(bytes_read < 2){
        			if(bytes_read < 1)
        				plus_store_status[bytes_read] = (uint8_t)c;

        		}else if(num_menu_entries < NUM_MENU_ITEMS){
                    if(count == 0){ // first char defines if its an entry row
                    	is_entry_row = (c >= '0' && c <= '9' ); // First char is entry.type '0' to '9'
                        if(is_entry_row){
                        	dst->type = c - 48;
                        }
                    }else if( is_entry_row ){
                    	if(count == 1){
                            dst->filesize = 0U;
                            pos = 0;
                    	}else if( count < 8 ){ // get the filesize
                   			dst->filesize = dst->filesize * 10 + (uint8_t)( c - '0' );
                    	}else if( count > 8 && count < 41 && c != '\n'){ // filename/dirname should begin at index 9
                    		dst->entryname[pos] = c;
                    		pos++;
                    	}
                    }
                    if (c == '\n'){
                    	if(is_entry_row){
                    		dst->entryname[pos] = '\0';
                    		dst->font = user_settings.font_style;
                            dst++;
                            num_menu_entries++;
                    	}
                        count = 0;
                    }else{
                        count++;
                    }
        		}
        		bytes_read++;
        	}

        	esp8266_PlusStore_API_end_transmission();
        }else if(strlen(curPath) == 0){

/*        	// re-ask for wifi connection details
			menuStatusMessage = select_wifi_network;
			make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
			if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
	    		return esp_timeout;
	    	}
*/


        	make_menu_entry(&dst, MENU_TEXT_WIFI_RECONNECT, Menu_Action);
    	}
    }

