Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	uint8_t act_page = 0;
    MENU_ENTRY *d = &menu_entries[0];

  /* USER CODE END 1 */


  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();

  /* USER CODE BEGIN 2 */

  user_settings = flash_get_eeprom_user_settings();
  set_tv_mode(user_settings.tv_mode);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  enum e_status_message menuStatusMessage = STATUS_ROOT; //, main_status = none;
  while (1){


    int ret = emulate_firmware_cartridge();

	if (ret == CART_CMD_ROOT_DIR) {
		system_secondary_init();

		d->type = Root_Menu;
		d->filesize = 0;

		*input_field = *curPath = 0;
		inputActive = MODE_SHOW_PATH;

		menuStatusMessage = buildMenuFromPath(d);
	}

	else if (ret == CART_CMD_PAGE_DOWN) {
		act_page--;
	}

	else if (ret == CART_CMD_PAGE_UP) {
		act_page++;
	}

	else {

		ret += act_page * numMenuItemsPerPage[user_settings.line_spacing];
		d = &menu_entries[ret];

		act_page = 0; // seems to fix the "blank" menus - because page # was not init'd on new menu

		if (d->type == Cart_File || d->type == Offline_Cart_File) {

			// TODO: THIS MAGIC NUMBER "12" SHOULD BE FIXED TO AN EQUATE
			// selection is a rom file
			int32_t max_romsize = (((BUFFER_SIZE + CCM_RAM_SIZE) * 1024)
					+ (12 - user_settings.first_free_flash_sector) * 128 * 1024);	//TODO: what's the 12?  linespermenu?

			if (d->filesize > max_romsize)
				menuStatusMessage /*main_status*/ = not_enough_menory;

			else {

				CART_TYPE cart_type = identify_cartridge(d);
				HAL_Delay(200);

				if (cart_type.base_type == base_type_ACE)
					menuStatusMessage = /*main_status =*/ romtype_ACE_unsupported;

				else if (cart_type.base_type == base_type_Load_Failed)
					menuStatusMessage = /*main_status = */rom_download_failed;

				else if (cart_type.base_type != base_type_None) {

					emulate_cartridge(cart_type, d);
					set_menu_status_byte(STATUS_StatusByteReboot, 0);
					menuStatusMessage = /*main_status = */exit_emulation;


					// ...?
					if (d->filesize > (BUFFER_SIZE * 1024)) { // reload menu
						truncate_curPath(1);
						menuStatusMessage = buildMenuFromPath(d);
					}
				}

				else
					menuStatusMessage = /*main_status = */romtype_unknown;
			}

			truncate_curPath(1);

		}

		else {  // not a cart file...

			// selection is a directory or Menu_Action, or Keyboard_Char
			if (d->type == Leave_Menu) {

				if (strstr(curPath, "Search") == curPath)
					*curPath = 0;
				else
					truncate_curPath(1);

				inputActive = MODE_SHOW_PATH;
				*input_field = 0;
			}

			else if (d->type == Delete_Keyboard_Char) {

				unsigned int len = strlen(input_field);
				if (len) {
					input_field[--len] = 0;
					curPath[strlen(curPath) - 1] = 0;
				}
				menuStatusMessage = /*main_status = */keyboard_input;

			} else {

				// go into Menu TODO find better way for separation of first keyboard char!!
				// TODO: odd  -- essentially if the string is exact "Search Rom" or "connect" then a "/" is suffixed
				// this is a separator for the API I guess.


				if ((d->type != Keyboard_Char && strlen(curPath) > 0)
						|| !strcmp(MENU_TEXT_SETUP"/"MENU_TEXT_PLUS_CONNECT, curPath)
						|| !strcmp(MENU_TEXT_SEARCH_FOR_ROM, curPath)) {
					strcat(curPath, "/");
				}

				if (!strcmp(d->entryname, MENU_TEXT_SPACE))
					strcpy(d->entryname, " ");

				append_entry_to_path(d);

				if (d->type == Keyboard_Char) {

					if (inputActive == MODE_SHOW_INPUT)
						strcat(input_field, d->entryname);

					inputActive = MODE_SHOW_INPUT;

					if (strlen(input_field) > STATUS_MESSAGE_LENGTH) {
						for (int i = 0; i < STATUS_MESSAGE_LENGTH; i++) {
							input_field[i] = input_field[i + 1];
						}
					}
					menuStatusMessage = /*main_status = */keyboard_input;
				}

				else {
					if (d->type == Menu_Action) {
						inputActive = MODE_SHOW_PATH;
						*input_field = 0; //input_field[0] = 0;
					}
				}
			}
			menuStatusMessage = buildMenuFromPath(d);
		}
	}



    // Menu status message and PageType byte
    //main_status = (main_status != none)?main_status:menuStatusMessage;

//    if(main_status == keyboard_input){
//    	set_menu_status_msg);
//    	set_menu_status_byte(STATUS_PageType, (uint8_t) Keyboard);
//    }


	if (*input_field) {
		set_menu_status_msg(input_field);
		set_menu_status_byte(STATUS_PageType, (uint8_t) Keyboard);
	}

    else {

    	if (menuStatusMessage >= 0)
    		set_menu_status_msg(status_message[menuStatusMessage]);

    	if(act_page > (num_menu_entries / numMenuItemsPerPage[user_settings.line_spacing]) )
    		act_page = 0;

    	set_menu_status_byte(STATUS_PageType, (uint8_t) Directory);
    }
    bool paging_required = (menuStatusMessage == /*(main_status == */paging);
    bool is_connected = esp8266_is_connected();

    createMenuForAtari(menu_entries, act_page, num_menu_entries, paging_required, is_connected, plus_store_status );
    HAL_Delay(200);

  } // while(1)
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the CPU, AHB and APB busses clocks
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

